app/controllers/coins_controller.rb

  def show
    @coin = Coin.find(params[:id])
---
SELECT "coins".* FROM "coins" WHERE "coins"."id" = $1 LIMIT 1  [["id", "1"]]

  def create
  	@coin = Coin.new(params[:coin])
  	if @coin.save
---
INSERT INTO "coins" ("condition", "created_at", "description", "for_sale", "for_trade", "image", "market_value", "name", "origin", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"

  def edit
  	@coin = Coin.find(params[:id])
---
SELECT "coins".* FROM "coins" WHERE "coins"."id" = $1 LIMIT 1  [["id", "1"]]

  def update
  	@coin = Coin.find(params[:id])
  	if @coin.update_attributes(params[:coin])
---
SELECT "coins".* FROM "coins" WHERE "coins"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "coins" SET "name" = '1959 10C Silver', "description" = 'PCGS Slabbed', "market_value" = 50000, "updated_at" = '2013-06-26 11:53:01.911095' WHERE "coins"."id" = 1

  def destroy
  	@coin = Coin.find(params[:id])
		if @coin.destroy
---
SELECT "coins".* FROM "coins" WHERE "coins"."id" = $1 LIMIT 1  [["id", "2"]]
DELETE FROM "coins" WHERE "coins"."id" = $1  [["id", 2]]